In [1]:
import os

os.makedirs(os.path.join('..', 'data'), exist_ok=True)
data_file = os.path.join('..', 'data', 'house_tiny.csv')
with open(data_file, 'w') as f:
    f.write('''NumRooms,RoofType,Price
NA,NA,127500
2,NA,106000
4,Slate,178100
NA,NA,140000''')

In [79]:
import pandas as pd

data = pd.read_csv(data_file)
data

   NumRooms RoofType   Price
0       NaN      NaN  127500
1       2.0      NaN  106000
2       4.0    Slate  178100
3       NaN      NaN  140000

In [91]:
inputs, targets = data.iloc[:,:2],data.iloc[:, 2]

inputs = pd.get_dummies(inputs, dummy_na=1.0).astype(float)
# inputs['RoofType_nan'] = inputs['RoofType_nan'].astype(float)
# inputs['RoofType_Slate'] = inputs['RoofType_Slate'].astype(float)
inputs

   NumRooms  RoofType_Slate  RoofType_nan
0       NaN             0.0           1.0
1       2.0             0.0           1.0
2       4.0             1.0           0.0
3       NaN             0.0           1.0

In [92]:
targets

0    127500
1    106000
2    178100
3    140000
Name: Price, dtype: int64

In [93]:
inputs = inputs.fillna(value=inputs.mean())
inputs

   NumRooms  RoofType_Slate  RoofType_nan
0       3.0             0.0           1.0
1       2.0             0.0           1.0
2       4.0             1.0           0.0
3       3.0             0.0           1.0

In [94]:
inputs.values,targets.values

(array([[3., 0., 1.],
        [2., 0., 1.],
        [4., 1., 0.],
        [3., 0., 1.]]),
 array([127500, 106000, 178100, 140000]))

In [95]:
import torch
inputs.values
targets.values
x = torch.from_numpy(inputs.values)

In [96]:
d = pd.read_csv('../data/wether.csv')
d

    location weather        date
0    beijing   rainy  2023-07-14
1    chengdu   sunny  2023-07-14
2  chongqing  cloudy  2023-07-14
3  shenzheng   sunny  2023-07-14

In [101]:
d.iloc[2]

location     chongqing
weather         cloudy
date        2023-07-14
Name: 2, dtype: object